{
  "text": {
    "test": {
      "ru": [
        "                                Для начала нам понадобятся следующие ингредиенты:\n- 2 стакана муки\n- 2 яйца\n- 2 стакана молока\n- 2 столовые ложки растительного масла\n- 1 столовая ложка сахара\n- 1 чайная ложка соли\n- 1/2 чайной ложки разрыхлителя (по желанию)",
        "Сначала в глубокой миске смешайте яйца с сахаром и солью.\nВзбейте их венчиком или миксером до появления легкой пены.\nЭтот этап поможет сделать блины более воздушными.",
        "Теперь в полученную массу постепенно добавляйте молоко.\nПродолжайте взбивать, чтобы масса была однородной.\nЕсли хотите более нежные блины, используйте теплое молоко.",
        "После того, как молоко хорошо перемешано с яичной смесью, начинайте сыпать муку.\nДелайте это постепенно, чтобы избежать образования комков.\nВзбивайте до получения однородного теста.",
        "Добавьте растительное масло в тесто и снова хорошо перемешайте.\nМасло делает блины более мягкими и предотвращает их прилипание к сковороде. ",
        "Если вы решили использовать разрыхлитель, добавьте его на этом этапе.\nОн сделает блины более пышными.\nПеремешайте тесто до однородности.\nДайте ему настояться около 30 минут.",
        "Разогрейте сковороду на среднем огне.\nМожно смазать ее небольшим количеством растительного масла или использовать антипригарную поверхность.",
        "Когда сковорода нагреется, начинайте выпекать блины.\nДля этого налейте немного теста на сковороду и наклоните её, чтобы тесто равномерно распределилось по поверхности.",
        "Жарьте блин до появления пузырьков на поверхности и золотистой корочки снизу,\nзатем переверните его с помощью лопатки и поджарьте с другой стороны.                       ",
        "Готовые блины можно подавать с разнообразными начинками:\nвареньем, медом, сгущенкой или сметаной.\nПриятного аппетита!"
      ],
      "en": [
        "To start, you'll need the following ingredients:\n- 2 cups of flour\n- 2 eggs\n- 2 cups of milk\n- 2 tablespoons of vegetable oil\n- 1 tablespoon of sugar\n- 1 teaspoon of salt\n- 1/2 teaspoon of baking powder (optional)  ",
        "In a large bowl, mix the eggs with sugar and salt.\nBeat them until light and frothy.  ",
        "Gradually add milk to the egg mixture, stirring continuously until smooth.",
        "Slowly add flour, mixing to avoid lumps and to achieve a uniform batter.  ",
        "Add vegetable oil to the batter and mix well. ",
        "If using baking powder, add it now and mix to combine.\nLet the batter rest for about 30 minutes.  ",
        "Heat a frying pan over medium heat, greasing lightly if necessary.  ",
        "Pour some batter into the pan, tilting it to spread evenly.  ",
        "Cook until bubbles form on the surface and the edges are golden, then flip and cook the other side.  ",
        "Serve the pancakes with various toppings like jam, honey, or sour cream.\nEnjoy!  "
      ],
      "zh": [
        "首先，你需要以下材料：\n- 2杯面粉\n- 2个鸡蛋\n- 2杯牛奶\n- 2汤匙植物油\n- 1汤匙糖\n- 1茶匙盐\n- 1/2茶匙泡打粉（可选）  ",
        "在一个大碗中，将鸡蛋与糖和盐混合。\n搅打至轻盈起泡。  ",
        "逐渐将牛奶加入鸡蛋混合物，持续搅拌，直至光滑。  ",
        "慢慢加入面粉，搅拌以避免结块，直到面糊均匀。   ",
        "将植物油加入面糊中，搅拌均匀。",
        "如果使用泡打粉，立即加入并混合。\n让面糊静置约30分钟。  ",
        "中火加热平底锅，如有必要可稍微涂油。  ",
        "将一些面糊倒入锅中，倾斜锅以均匀分布面糊。  ",
        "煮至表面冒泡，边缘呈金色，然后翻转，煮另一面。  ",
        "可用果酱、蜂蜜或酸奶油等不同配料食用煎饼。\n享用！"
      ]
    },
    "null": {
      "ru": [
        "Ноль"
      ],
      "en": [
        "Null"
      ],
      "zh": [
        "零"
      ]
    }
  }
}